{
    "hardSkills" : [
        { 
            "name" : "C#" ,
            "description" : "C# мой первый полноценно изученный ЯП. Уверенно работаю с ним и знаю большинство современных инструментов разработки в среде .NET."
        },
        {
            "name": "ASP.NET Core",
            "description" : "Умею разрабатывать REST-API используя ASP.NET Core. Это работа с БД, контроллерами, эндпоинтами, DTO и Middleware (написание своих или внедрение готовых). Ограничение доступа к методам, используя авторизацию (JWT, Cookie). Также есть опыт разработки веб-сайтов используя razor-pages и архитектуру MVC."
        },
        {
            "name" : "SQL",
            "description" : "Умею разрабатывать БД на MS SQL, My SQL, Postgre SQL. Могу писать запросы с JOIN, SORT BY, GROUP BY, HAVING, с агрегатными функциями. Есть навыки работы с хранимыми процедурами, представлениями, с вложенными запросами."
        },
        {
            "name" : "ADO.NET",
            "description" : "Умею работать с ADO для взаимодействия с БД. Это подключение к БД, работа с таблицами, создание запросов, работа с данными уходящими в запрос или приходящими из ответа, массовое копирование в таблицу."
        },
        {
            "name" : "Entity Framework",
            "description" : ""
        },
        {
            "name" : "WPF",
            "description" : "Умею писать Desktop приложения. Есть опыт написание с MVVM архитектурой. Хорошо изучил верстку и разработку шаблонов компонентов приложения."
        },
        {
            "name" : "React",
            "description" : "Умею разрабатывать веб-сайты на React. С функциональными компонентами, хуками, запросами в API, модульными стилями, с TypeScript-ом. Собственно, этот сайт написан на React + TS."
        },
        {
            "name" : "JavaScript/TypeScript",
            "description" : "Большую часть опыта с JavaScript получил во время изучения React. Вскоре перешел на TypeScript. Почти уверенно чувствую себя с этими языками, но все ещё продолжаю активно их изучать."
        },
        {
            "name" : "HTML/CSS",
            "description" : ""
        },
        {
            "name" : "GIT",
            "description" : "Умею работать системой управления версий (Git) и постоянно ею пользуюсь. Предпочитаю взаимодействовать с инструментом, встроенным в редактор кода. Также, могу работать с консолью."
        }
    ],
    "projects":  [
        {
            "name" : "suiqrim-website ",
            "description" : "Вебсайт, который вы сейчас просматриваете. Он красивый, удобный и информативный",
            "link" : "https://github.com/SuiQRim/suqirim-website",
            "technologies" : [
                {
                    "name" : "React",
                    "description" : ""
                },
                {
                    "name" : "HTML/CSS",
                    "description" : ""
                },
                {
                    "name" : "TypeScript",
                    "description" : ""
                }
            ]
        },
        {
            "name" : "ToyRuParser",
            "description" : "Парсер сайта-каталога игрушек. Приложение сделано легко адаптируемым к изменениям сайта. Парсинг происходит учитывая пагинацию каталога",
            "link" : "https://github.com/SuiQRim/ToyRuParser",
            "technologies" : [
                {
                    "name" : "C#",
                    "description" : ""
                },
                {
                    "name" : "AngleSharp",
                    "description" : "Использовал библиотеку, которая предоставляет функционал для парсинга сайта"
                }
            ]
        },
        {
            "name" : "SkillProfi ",
            "description" : "CRM с серверной частью на ASP.NET и приложениями для администрирования и просмотра",
            "link" : "https://github.com/SuiQRim/SkillProfi",
            "technologies" : [
                {
                    "name" : "C#",
                    "description" : ""
                },
                {
                    "name" : "ASP.NET Core",
                    "description" : "На ASP.NET Core написана серверная часть. Для управления БД использовал Entity Framework. На сервере есть авторизация по JWT токену. Для передачи данных между сервером и клиентами используются DTO модели"
                },
                {
                    "name" : "Entity Framework",
                    "description" : "Используется для управления БД на сервере"
                },
                {
                    "name" : "Razor MVC",
                    "description" : "На ASP.NET MVC написан веб-сайт, которым могут пользоватся клиенты и андмины. Администраторам доступен функционал редактирования данных. Для этого реализована авторизация Cookie, в котором хранится JWT токен полученный при авторизации на сервере. Клиентам без авторизации не виден интерфейс админов. Сайт красивый, простой и функциональный"
                },
                {
                    "name" : "WPF",
                    "description" : "С помощью WPF написано Desktop приложение для администраторов. Есть полный функционал для взаимодействия с БД. Авторизация сессионая, путем хранения JWT токена, полученного с сервера. Вид красивый, старался над созданием шаблонов для элементов интерфейса"
                },
                {
                    "name" : "Telegram API",
                    "description" : "Использовал для написания телеграм бота, с помощью которого клиенты могут получить функционал, предоставленный на сайте."
                }
            ]
        },
        {
            "name" : "SnakeGame",
            "description" : "Консольная змейка, с меню и локальным лидербордом. Реализовал очень крутой интерфейс для консоли",
            "link" : "https://github.com/SuiQRim/SnakeGame",
            "technologies" : [
                {
                    "name" : "C#",
                    "description" : ""
                }
            ]
        }
    ]
}